#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ami.amazon_linux: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=590184068436]
data.aws_ami.amazon_linux: Read complete after 1s [id=ami-0e2c86481225d3c51]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.tls_certificate.eks will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # aws_ecr_repository.app_repo will be created
  + resource "aws_ecr_repository" "app_repo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "my-eks-cluster-app"
      + region               = "us-east-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "my-eks-cluster-ecr-repo"
        }
      + tags_all             = {
          + "Name" = "my-eks-cluster-ecr-repo"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "us-east-1"
      + tags                 = {
          + "Name" = "my-eks-cluster-nat-eip"
        }
      + tags_all             = {
          + "Name" = "my-eks-cluster-nat-eip"
        }
    }

  # aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name           = "coredns"
      + addon_version        = "v1.11.1-eksbuild.8"
      + arn                  = (known after apply)
      + cluster_name         = "my-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-1"
      + tags                 = {
          + "Name" = "my-eks-cluster-coredns"
        }
      + tags_all             = {
          + "Name" = "my-eks-cluster-coredns"
        }
    }

  # aws_eks_addon.ebs_csi will be created
  + resource "aws_eks_addon" "ebs_csi" {
      + addon_name           = "aws-ebs-csi-driver"
      + addon_version        = "v1.35.0-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "my-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-1"
      + tags_all             = (known after apply)
    }

  # aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name           = "kube-proxy"
      + addon_version        = "v1.31.0-eksbuild.5"
      + arn                  = (known after apply)
      + cluster_name         = "my-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-1"
      + tags                 = {
          + "Name" = "my-eks-cluster-kube-proxy"
        }
      + tags_all             = {
          + "Name" = "my-eks-cluster-kube-proxy"
        }
    }

  # aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name           = "vpc-cni"
      + addon_version        = "v1.18.1-eksbuild.3"
      + arn                  = (known after apply)
      + cluster_name         = "my-eks-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + region               = "us-east-1"
      + tags                 = {
          + "Name" = "my-eks-cluster-vpc-cni"
        }
      + tags_all             = {
          + "Name" = "my-eks-cluster-vpc-cni"
        }
    }

  # aws_eks_cluster.main will be created
  + resource "aws_eks_cluster" "main" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "my-eks-cluster"
      + platform_version              = (known after apply)
      + region                        = "us-east-1"
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Name" = "my-eks-cluster"
        }
      + tags_all                      = {
          + "Name" = "my-eks-cluster"
        }
      + version                       = "1.31"

      + access_config {
          + authentication_mode                         = (known after apply)
          + bootstrap_cluster_creator_admin_permissions = (known after apply)
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing {
              + enabled = (known after apply)
            }
        }

      + upgrade_policy {
          + support_type = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.main will be created
  + resource "aws_eks_node_group" "main" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "my-eks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "my-eks-cluster-nodes"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + region                 = "us-east-1"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "my-eks-cluster-node-group"
        }
      + tags_all               = {
          + "Name" = "my-eks-cluster-node-group"
        }
      + version                = (known after apply)

      + node_repair_config {
          + enabled = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 4
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_instance_profile.bastion_profile will be created
  + resource "aws_iam_instance_profile" "bastion_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "my-eks-cluster-bastion-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "my-eks-cluster-bastion-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_openid_connect_provider.eks will be created
  + resource "aws_iam_openid_connect_provider" "eks" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "my-eks-cluster-oidc-provider"
        }
      + tags_all        = {
          + "Name" = "my-eks-cluster-oidc-provider"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # aws_iam_policy.eks_basic_with_access_entries will be created
  + resource "aws_iam_policy" "eks_basic_with_access_entries" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows EKS list/describe, Kubernetes API access, and managing EKS access entries."
      + id               = (known after apply)
      + name             = "EKSBasicWithAccessEntries"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:ListClusters",
                          + "eks:DescribeCluster",
                          + "eks:AccessKubernetesApi",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "EksListDescribeAndK8sApi"
                    },
                  + {
                      + Action   = [
                          + "eks:CreateAccessEntry",
                          + "eks:DeleteAccessEntry",
                          + "eks:DescribeAccessEntry",
                          + "eks:ListAccessEntries",
                          + "eks:AssociateAccessPolicy",
                          + "eks:DisassociateAccessPolicy",
                          + "eks:ListAssociatedAccessPolicies",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "EksAccessEntriesManage"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.bastion_role will be created
  + resource "aws_iam_role" "bastion_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "my-eks-cluster-bastion-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "my-eks-cluster-bastion-role"
        }
      + tags_all              = {
          + "Name" = "my-eks-cluster-bastion-role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.eks_cluster_role will be created
  + resource "aws_iam_role" "eks_cluster_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "my-eks-cluster-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "my-eks-cluster-cluster-role"
        }
      + tags_all              = {
          + "Name" = "my-eks-cluster-cluster-role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.eks_node_group_role will be created
  + resource "aws_iam_role" "eks_node_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "my-eks-cluster-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "my-eks-cluster-node-group-role"
        }
      + tags_all              = {
          + "Name" = "my-eks-cluster-node-group-role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.bastion_basic_access will be created
  + resource "aws_iam_role_policy_attachment" "bastion_basic_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "my-eks-cluster-bastion-role"
    }

  # aws_iam_role_policy_attachment.bastion_ecr_policy will be created
  + resource "aws_iam_role_policy_attachment" "bastion_ecr_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess"
      + role       = "my-eks-cluster-bastion-role"
    }

  # aws_iam_role_policy_attachment.bastion_eks_policy will be created
  + resource "aws_iam_role_policy_attachment" "bastion_eks_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "my-eks-cluster-bastion-role"
    }

  # aws_iam_role_policy_attachment.bastion_ssm_policy will be created
  + resource "aws_iam_role_policy_attachment" "bastion_ssm_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "my-eks-cluster-bastion-role"
    }

  # aws_iam_role_policy_attachment.eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "my-eks-cluster-cluster-role"
    }

  # aws_iam_role_policy_attachment.eks_cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "my-eks-cluster-node-group-role"
    }

  # aws_iam_role_policy_attachment.eks_container_registry_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_container_registry_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "my-eks-cluster-node-group-role"
    }

  # aws_iam_role_policy_attachment.eks_ssm_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_ssm_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "my-eks-cluster-node-group-role"
    }

  # aws_iam_role_policy_attachment.eks_worker_node_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_worker_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "my-eks-cluster-node-group-role"
    }

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-0e2c86481225d3c51"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "my-eks-cluster-bastion-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "us-east-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "my-eks-cluster-bastion"
        }
      + tags_all                             = {
          + "Name" = "my-eks-cluster-bastion"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "IyEvYmluL2Jhc2gKCiMgVXBkYXRlIHRoZSBzeXN0ZW0KeXVtIHVwZGF0ZSAteQoKIyBJbnN0YWxsIHJlcXVpcmVkIHBhY2thZ2VzCnl1bSBpbnN0YWxsIC15IGN1cmwgd2dldCBnaXQgdW56aXAKCgojIEluc3RhbGwga3ViZWN0bApjdXJsIC1MTyAiaHR0cHM6Ly9kbC5rOHMuaW8vcmVsZWFzZS8kKGN1cmwgLUwgLXMgaHR0cHM6Ly9kbC5rOHMuaW8vcmVsZWFzZS9zdGFibGUudHh0KS9iaW4vbGludXgvYW1kNjQva3ViZWN0bCIKaW5zdGFsbCAtbyByb290IC1nIHJvb3QgLW0gMDc1NSBrdWJlY3RsIC91c3IvbG9jYWwvYmluL2t1YmVjdGwKCiMgSW5zdGFsbCBla3NjdGwKY3VybCAtLXNpbGVudCAtLWxvY2F0aW9uICJodHRwczovL2dpdGh1Yi5jb20vd2VhdmV3b3Jrcy9la3NjdGwvcmVsZWFzZXMvbGF0ZXN0L2Rvd25sb2FkL2Vrc2N0bF8kKHVuYW1lIC1zKV9hbWQ2NC50YXIuZ3oiIHwgdGFyIHh6IC1DIC90bXAKbXYgL3RtcC9la3NjdGwgL3Vzci9sb2NhbC9iaW4KCiMgSW5zdGFsbCBIZWxtCmN1cmwgLWZzU0wgLW8gZ2V0X2hlbG0uc2ggaHR0cHM6Ly9yYXcuZ2l0aHVidXNlcmNvbnRlbnQuY29tL2hlbG0vaGVsbS9tYWluL3NjcmlwdHMvZ2V0LWhlbG0tMwpjaG1vZCA3MDAgZ2V0X2hlbG0uc2gKLi9nZXRfaGVsbS5zaAoKIyBJbnN0YWxsIERvY2tlciAoZm9yIGJ1aWxkaW5nIGltYWdlcykKeXVtIGluc3RhbGwgLXkgZG9ja2VyCnN5c3RlbWN0bCBzdGFydCBkb2NrZXIKc3lzdGVtY3RsIGVuYWJsZSBkb2NrZXIKdXNlcm1vZCAtYSAtRyBkb2NrZXIgZWMyLXVzZXIKCiMgQ29uZmlndXJlIGt1YmVjdGwgZm9yIHRoZSBFS1MgY2x1c3Rlcgpta2RpciAtcCAvaG9tZS9lYzItdXNlci8ua3ViZQphd3MgZWtzIHVwZGF0ZS1rdWJlY29uZmlnIC0tcmVnaW9uIHVzLWVhc3QtMSAtLW5hbWUgbXktZWtzLWNsdXN0ZXIgLS1rdWJlY29uZmlnIC9ob21lL2VjMi11c2VyLy5rdWJlL2NvbmZpZwpjaG93biAtUiBlYzItdXNlcjplYzItdXNlciAvaG9tZS9lYzItdXNlci8ua3ViZQoKIyBDcmVhdGUgaGVscGZ1bCBzY3JpcHRzIGZvciBlYzItdXNlcgpjYXQgPDwgJ0VPRicgPiAvaG9tZS9lYzItdXNlci91cGRhdGUta3ViZWNvbmZpZy5zaAojIS9iaW4vYmFzaAphd3MgZWtzIHVwZGF0ZS1rdWJlY29uZmlnIC0tcmVnaW9uIHVzLWVhc3QtMSAtLW5hbWUgbXktZWtzLWNsdXN0ZXIKZWNobyAiS3ViZWNvbmZpZyB1cGRhdGVkIGZvciBjbHVzdGVyOiBteS1la3MtY2x1c3RlciIKRU9GCgpjYXQgPDwgJ0VPRicgPiAvaG9tZS9lYzItdXNlci9nZXQtY2x1c3Rlci1pbmZvLnNoCiMhL2Jpbi9iYXNoCmVjaG8gIj09PSBFS1MgQ2x1c3RlciBJbmZvID09PSIKa3ViZWN0bCBjbHVzdGVyLWluZm8KZWNobyAiIgplY2hvICI9PT0gTm9kZXMgPT09IgprdWJlY3RsIGdldCBub2RlcwplY2hvICIiCmVjaG8gIj09PSBQb2RzIGluIGFsbCBuYW1lc3BhY2VzID09PSIKa3ViZWN0bCBnZXQgcG9kcyAtLWFsbC1uYW1lc3BhY2VzCkVPRgoKY2htb2QgK3ggL2hvbWUvZWMyLXVzZXIvKi5zaApjaG93biBlYzItdXNlcjplYzItdXNlciAvaG9tZS9lYzItdXNlci8qLnNoCgojIENyZWF0ZSBhIHdlbGNvbWUgbWVzc2FnZQpjYXQgPDwgJ0VPRicgPiAvaG9tZS9lYzItdXNlci9SRUFETUUudHh0CldlbGNvbWUgdG8gdGhlIEVLUyBCYXN0aW9uIEhvc3QhCgpUaGlzIGluc3RhbmNlIGlzIGNvbmZpZ3VyZWQgd2l0aDoKLSBBV1MgQ0xJIHYyCi0ga3ViZWN0bAotIGVrc2N0bAotIGhlbG0KLSBkb2NrZXIKCkF2YWlsYWJsZSBzY3JpcHRzOgotIC4vdXBkYXRlLWt1YmVjb25maWcuc2ggLSBVcGRhdGVzIGt1YmVjdGwgY29uZmlndXJhdGlvbiBmb3IgdGhlIEVLUyBjbHVzdGVyCi0gLi9nZXQtY2x1c3Rlci1pbmZvLnNoIC0gU2hvd3MgY2x1c3RlciBpbmZvcm1hdGlvbiBhbmQgcnVubmluZyBwb2RzCgpUaGUga3ViZWNvbmZpZyBpcyBhbHJlYWR5IGNvbmZpZ3VyZWQgZm9yIGNsdXN0ZXI6IG15LWVrcy1jbHVzdGVyCgpUbyBnZXQgc3RhcnRlZDoKMS4gVGVzdCBjbHVzdGVyIGFjY2Vzczoga3ViZWN0bCBnZXQgbm9kZXMKMi4gVmlldyBwb2RzOiBrdWJlY3RsIGdldCBwb2RzIC0tYWxsLW5hbWVzcGFjZXMKMy4gQWNjZXNzIHZpYSBTU006IGF3cyBzc20gc3RhcnQtc2Vzc2lvbiAtLXRhcmdldCAkKGN1cmwgLXMgaHR0cDovLzE2OS4yNTQuMTY5LjI1NC9sYXRlc3QvbWV0YS1kYXRhL2luc3RhbmNlLWlkKQpFT0YKCmNob3duIGVjMi11c2VyOmVjMi11c2VyIC9ob21lL2VjMi11c2VyL1JFQURNRS50eHQKCiMgSW5zdGFsbCBTU00gYWdlbnQgKHNob3VsZCBhbHJlYWR5IGJlIGluc3RhbGxlZCBvbiBBbWF6b24gTGludXggMikKeXVtIGluc3RhbGwgLXkgYW1hem9uLXNzbS1hZ2VudApzeXN0ZW1jdGwgc3RhcnQgYW1hem9uLXNzbS1hZ2VudApzeXN0ZW1jdGwgZW5hYmxlIGFtYXpvbi1zc20tYWdlbnQKCmVjaG8gIkJhc3Rpb24gaG9zdCBzZXR1cCBjb21wbGV0ZWQgc3VjY2Vzc2Z1bGx5ISI="
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + instance_market_options {
          + market_type = (known after apply)

          + spot_options {
              + instance_interruption_behavior = (known after apply)
              + max_price                      = (known after apply)
              + spot_instance_type             = (known after apply)
              + valid_until                    = (known after apply)
            }
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags     = {
          + "Name" = "my-eks-cluster-igw"
        }
      + tags_all = {
          + "Name" = "my-eks-cluster-igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.main will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-east-1"
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "my-eks-cluster-nat-gateway"
        }
      + tags_all                           = {
          + "Name" = "my-eks-cluster-nat-gateway"
        }
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "my-eks-cluster-private-rt"
        }
      + tags_all         = {
          + "Name" = "my-eks-cluster-private-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "my-eks-cluster-public-rt"
        }
      + tags_all         = {
          + "Name" = "my-eks-cluster-public-rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Security group for bastion host"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "my-eks-cluster-bastion-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "my-eks-cluster-bastion-sg"
        }
      + tags_all               = {
          + "Name" = "my-eks-cluster-bastion-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.eks_cluster will be created
  + resource "aws_security_group" "eks_cluster" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS cluster control plane"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "my-eks-cluster-cluster-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "my-eks-cluster-cluster-sg"
        }
      + tags_all               = {
          + "Name" = "my-eks-cluster-cluster-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.eks_nodes will be created
  + resource "aws_security_group" "eks_nodes" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS worker nodes"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 65535
            },
        ]
      + name                   = "my-eks-cluster-node-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "my-eks-cluster-node-sg"
        }
      + tags_all               = {
          + "Name" = "my-eks-cluster-node-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.cluster_inbound_https will be created
  + resource "aws_security_group_rule" "cluster_inbound_https" {
      + description              = "Allow worker nodes to communicate with cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.nodes_inbound_cluster_kubelet will be created
  + resource "aws_security_group_rule" "nodes_inbound_cluster_kubelet" {
      + description              = "Allow cluster control plane to communicate with kubelet"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # aws_security_group_rule.nodes_outbound_cluster_https will be created
  + resource "aws_security_group_rule" "nodes_outbound_cluster_https" {
      + description              = "Allow pods to communicate with the cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-east-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"                                 = "my-eks-cluster-private-subnet-1"
          + "Type"                                 = "Private"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"      = "1"
        }
      + tags_all                                       = {
          + "Name"                                 = "my-eks-cluster-private-subnet-1"
          + "Type"                                 = "Private"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"      = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.48.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"                                 = "my-eks-cluster-private-subnet-2"
          + "Type"                                 = "Private"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"      = "1"
        }
      + tags_all                                       = {
          + "Name"                                 = "my-eks-cluster-private-subnet-2"
          + "Type"                                 = "Private"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"      = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"                                 = "my-eks-cluster-public-subnet-1"
          + "Type"                                 = "Public"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/elb"               = "1"
        }
      + tags_all                                       = {
          + "Name"                                 = "my-eks-cluster-public-subnet-1"
          + "Type"                                 = "Public"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/elb"               = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Name"                                 = "my-eks-cluster-public-subnet-2"
          + "Type"                                 = "Public"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/elb"               = "1"
        }
      + tags_all                                       = {
          + "Name"                                 = "my-eks-cluster-public-subnet-2"
          + "Type"                                 = "Public"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
          + "kubernetes.io/role/elb"               = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-1"
      + tags                                 = {
          + "Name"                                 = "my-eks-cluster-vpc"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
        }
      + tags_all                             = {
          + "Name"                                 = "my-eks-cluster-vpc"
          + "kubernetes.io/cluster/my-eks-cluster" = "shared"
        }
    }

Plan: 43 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bastion_instance_id                = (known after apply)
  + bastion_public_ip                  = (known after apply)
  + bastion_role_arn                   = (known after apply)
  + cluster_arn                        = (known after apply)
  + cluster_certificate_authority_data = (known after apply)
  + cluster_endpoint                   = (known after apply)
  + cluster_name                       = "my-eks-cluster"
  + cluster_oidc_issuer_url            = (known after apply)
  + cluster_role_arn                   = (known after apply)
  + cluster_security_group_id          = (known after apply)
  + ecr_repository_url                 = (known after apply)
  + node_group_arn                     = (known after apply)
  + node_role_arn                      = (known after apply)
  + private_subnet_ids                 = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids                  = [
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id                             = (known after apply)

Warning: Value is base64 encoded

  with aws_instance.bastion,
  on eks.tf line 550, in resource "aws_instance" "bastion":
 550:   user_data = base64encode(templatefile("${path.module}/bastion_userdata.sh", {
 551:     cluster_name = var.cluster_name
 552:     region       = var.region
 553:   }))

The value is base64 encoded. If you want to use base64 encoding, please use
the user_data_base64 argument. user_data attribute is set as cleartext in
state

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @anuragrai63, Action: `pull_request`*